# 数据.py
from rwlock import RWLock
全_刷完 = False
全_启动时间 = ""
全_登录 = False
全_登录超时 = 0
全_图内超时 = 0
全_城镇超时 = 0
全_城镇 = False
全_登录方式 = 0
全_账号进度 = 0
全_角色进度 = 0
全_账号信息 = ""
全_账号 = ""
全_跨区 = ""
全_角色数 = "0"
wegame_登录 = (336, 366, 524, 411)
wegame_账户 = (479, 268)
wegame_验证 = (262, 92, 486, 114)
wegame_主页 = (398, 19, 436, 41)
wegame_启动 = (1129, 773, 1173, 797)
全_游戏更新 = False
游戏开始 = (327, 552, 485, 589)
公告_关闭 = (370, 449, 418, 468)  #判断每天的公告
游戏设置 = (232, 495, 293, 534)  #esc窗口
人物 = (627, 30, 662, 45)  #人物判断城镇
设置_选择角色 = (374, 490)
赛丽亚 = (424, 178, 466, 198)  #赛丽亚房间
制裁窗口 = (809, 36, 1103, 104)
全_关闭主线程 = False
全_关闭副线程 = False
全_超时捡物 = False
全_刷图超时 = 30
全_运行时长 = 0
全_通关次数 = 0
全_完成角色 = 0
全_进图 = False
全_暂停 = False
全_启动 = False
频道 = (598, 0, 738, 24)
全_脚本模式 = ""
选择角色 = (354, 505, 407, 524)
成长指南 = (358,17,440,34)
全_角色身高 = 0
全_角色疲劳 = 0
个人信息 = (177, 22, 310, 74)
全_角色名望 = 0
角色名望位置 = (264, 277, 304, 295)
副本名称 = (598, 0, 725, 24)
全_已加BUFF = False
全_所有门坐标 = []
全_所有怪物坐标 = []
全_所有物品坐标 = []
全_角色坐标 = (999,999)
rw_lock = RWLock()
全局锁 = rw_lock.reader_lock  #读锁
写锁 = rw_lock.writer_lock  #写锁
全_横向移动方向 = 'left'
全_纵向移动方向 = 'down'
全_左方向键 = False
全_上方向键 = False
全_右方向键 = False
全_下方向键 = False
全_无法拾取 = False
全_已中途分解 = False
全_不稳定裂缝 = False
# 服务端ip = '192.168.10.249'
服务端ip = '192.168.31.108'
比拉谢尔面板 = (579, 212)  #通过传送器传送到比拉谢尔号，面板的坐标
比拉谢尔面板_毁坏的克洛诺斯岛 = (191, 290)
所选地图名字 = (53, 290, 184, 316)
地图名 = "海伯伦的预言所"  #要刷的地图
全_游戏结束 = False

class 路径算法:
    def __init__(self, 地图数据, 起点, 终点):
        self.地图数据 = 地图数据
        self.起点 = 起点
        self.终点 = 终点


海伯伦的预言所 = 路径算法([
    [1, 1, 1, 1, 1],
    [1, 0, 0, 0, 0],
    [1, 0, 0, 0, 1],
    [1, 0, 0, 0, 1],
    [1, 0, 1, 1, 1]
], [4, 1], [1, 4])
海伯伦的预言所小地图位置 = (701, 26, 794, 121)
小地图位置 = 海伯伦的预言所小地图位置
小地图路径 = 海伯伦的预言所
#下述数据暂定，等待修改
小地图角色颜色 = (50, 150, 200)  #小于15，大于150，200才行
小地图Boss颜色 = (232, 80, 3)  #>200 <100,<20
小地图遍历步长 = 1
小地图名字 = (624, 0, 715, 20)
技能位置 = (299, 533, 514, 593)
技能颜色遍历步长 = 1
门坐标偏移 = 100
技能颜色 = (255, 255, 107)
技能字典 = {(0, 0): 'q', (0, 1): 'w', (0, 2): 'e', (0, 3): 'r', (0, 4): 't', (0, 5): 'y', (0, 6): 'ctrl',
            (1, 0): 'a', (1, 1): 's', (1, 2): 'd', (1, 3): 'f', (1, 4): 'g', (1, 5): 'h', (1, 6): 'alt'}
疲劳位置 = {"top": 594, "left": 657, "width": 1, "height": 1}
疲劳颜色 = (0, 184, 215)
跳过翻牌 = (309,18,394,45)
跳过 = (722,47,795,68)
